backend/controllers/SiteController.php

    public function actionProvince()
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = "";
        $toDate = "";
        if (Yii::$app->request->isAjax) {
            $fromDate = Yii::$app->request->post('fromDate');
            $toDate = Yii::$app->request->post('toDate');

            //----------------------START OF REGIONAL PROVINCE DAYS-----------------------------------

            $custmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Metro Manila']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andwhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART DAYS

            $forTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forCustomerTypeChart = (new Query())
                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])
                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forMyChart = (new Query()) //average income per division
                ->select(['division as label', 'ROUND(AVG(amount)) as data'])
                ->from('transaction')
                ->where(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $forMyChartAvgTransaction = (new Query())
                ->select(['COUNT(*) AS data'])
                ->from('transaction')
                ->where(['between', 'transaction_date', $fromDate, $toDate])
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address`='Metro Manila') AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE `transaction_date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE `transaction_date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE `transaction_date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `label`
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE `t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount)) AS `data` FROM `transaction` WHERE `transaction_date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `division`
SELECT COUNT(*) AS `data` FROM `transaction` WHERE `transaction_date` BETWEEN '2023-12-04' AND '2023-12-10'

    public function actionMonth()
    {
        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = Yii::$app->request->post('fromDate');
        $toDate = Yii::$app->request->post('toDate');

        if (Yii::$app->request->isAjax) {

            //----------------------START OF REGIONAL PROVINCE MONTHS-----------------------------------

            $monthcustmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Metro Manila']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthcustmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andwhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART MONTHS

            $monthforTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthforPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthforTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthforCustomerTypeChart = (new Query())
                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])
                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $monthforMyChart = (new Query())
                ->select(['division as label', 'ROUND(AVG(amount), 2) as data'])
                ->from('transaction')
                ->where(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $monthforMyChartAvgTransaction = (new Query())
                ->select(['division as label', 'count(*) as data'])
                ->from('transaction')
                ->where(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address`='Metro Manila') AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `label`
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount), 2) AS `data` FROM `transaction` WHERE DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `division`
SELECT `division` AS `label`, count(*) AS `data` FROM `transaction` WHERE DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12'

    public function actionYearly()
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = Yii::$app->request->post('fromDate');
        $toDate = Yii::$app->request->post('toDate');

        if (Yii::$app->request->isAjax) {

            //----------------------START OF REGIONAL PROVINCE MONTHS-----------------------------------

            $yearcustmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Metro Manila']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearcustmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andwhere(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART MONTHS

            $yearforTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'YEAR(transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearforPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'YEAR(transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearforTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['between', 'YEAR(transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearforCustomerTypeChart = (new Query())
                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])
                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['between', 'YEAR(t1.transaction_date)', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $yearforMyChart = (new Query())
                ->select(['division as label', 'ROUND(AVG(amount), 2) as data'])
                ->from('transaction')
                ->where(['between', 'YEAR(transaction_date)', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $yearforMyChartAvgTransaction = (new Query())
                ->select(['division as label', 'count(*) as data'])
                ->from('transaction')
                ->where(['between', 'YEAR(transaction_date)', $fromDate, $toDate])
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address`='Metro Manila') AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (YEAR(t1.transaction_date) BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE YEAR(transaction_date) BETWEEN '2023' AND '2023' GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE YEAR(transaction_date) BETWEEN '2023' AND '2023' GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE YEAR(transaction_date) BETWEEN '2023' AND '2023' GROUP BY `label`
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE YEAR(t1.transaction_date) BETWEEN '2023' AND '2023' GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount), 2) AS `data` FROM `transaction` WHERE YEAR(transaction_date) BETWEEN '2023' AND '2023' GROUP BY `division`
SELECT `division` AS `label`, count(*) AS `data` FROM `transaction` WHERE YEAR(transaction_date) BETWEEN '2023' AND '2023'

    public function actionIndex() //this is for the dashboard keme keme chemerut
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);
        //days
        $queryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
            ->select(['transaction_date AS labels', 'COUNT(*) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('transaction_date, division')
            ->orderBy('transaction_date')
            ->all();

        $dailyMapping = [ //to be used on renaming divisions
            "1" => "National Metrology Division",
            "2" => "Standards and Testing Division",
        ];

        foreach ($queryAllDate as &$item) { //to change division 1 & 2 into actual division name
            if (isset($item['label']) && isset($dailyMapping[$item['label']])) {
                $item['label'] = $dailyMapping[$item['label']];
            }
        }

        $queryAllDate2 = (new Query()) //daily transaction record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'transaction_date AS labels',
                'COUNT(*) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('transaction_date')
            ->orderBy('transaction_date')
            ->all();
---
SELECT `transaction_date` AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `transaction_date`, `division` ORDER BY `transaction_date`
SELECT `transaction_date` AS `labels`, COUNT(*) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `transaction_date` ORDER BY `transaction_date`

        $queryAllDate = array_values($queryAllDate); //insert total transaction into transaction per div array

        //--------------
        $queryTotalSale = (new Query()) //daily sales record seperated by division
            ->select(['transaction_date AS labels', 'SUM(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('transaction_date, division')
            ->orderBy('transaction_date')
            ->all();
---
SELECT `transaction_date` AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `transaction_date`, `division` ORDER BY `transaction_date`

            }
        }

        $queryTotalSale2 = (new Query()) //daily total sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'transaction_date AS labels',
                'SUM(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('transaction_date')
            ->orderBy('transaction_date')
            ->all();
---
SELECT `transaction_date` AS `labels`, SUM(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `transaction_date` ORDER BY `transaction_date`

        $queryTotalSale = array_values($queryTotalSale); //insert total sales into transaction per div array

        //--------------------
        $queryDivAverageSale = (new Query()) //daily average sales record seperated by division
            ->select(['transaction_date AS labels', 'AVG(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('transaction_date, division')
            ->orderBy('transaction_date')
            ->all();
---
SELECT `transaction_date` AS `labels`, AVG(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `transaction_date`, `division` ORDER BY `transaction_date`

            }
        }

        $queryTotalAverageSale = (new Query()) //daily total average sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'transaction_date AS labels',
                'AVG(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('transaction_date')
            ->orderBy('transaction_date')
            ->all();

        $queryAddress = (new Query()) //total customer per province
            ->select(['address AS labels', 'COUNT(*) as datasets'])
            ->from('customer')
            ->groupBy(['labels'])
            ->orderBy(['datasets' => SORT_DESC])
            ->all();
---
SELECT `transaction_date` AS `labels`, AVG(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `transaction_date` ORDER BY `transaction_date`
SELECT `address` AS `labels`, COUNT(*) AS `datasets` FROM `customer` GROUP BY `labels` ORDER BY `datasets` DESC


        //------FOR DATE FORMATTING-------END

        $chartLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
            ->select('date AS labels')
            ->from('date_label')
            ->groupBy('date')
            ->orderBy('date')
            ->all();

        //---------------------------------for month
        $monthqueryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
            ->select([
                'DATE_FORMAT(transaction_date, "%Y-%m") AS labels',
                'COUNT(*) AS datasets', 'division AS label'
            ])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('transaction_date')
            ->all();
---
SELECT `date` AS `labels` FROM `date_label` GROUP BY `date` ORDER BY `date`
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `transaction_date`

            }
        }

        $monthqueryAllDate2 = (new Query()) //daily transaction record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y-%m") AS labels',
                'COUNT(*) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, COUNT(*) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`

        $monthqueryAllDate = array_values($monthqueryAllDate); //insert total transaction into transaction per div array

        //--------------
        $monthqueryTotalSale = (new Query()) //daily sales record seperated by division
            ->select(['DATE_FORMAT(transaction_date, "%Y-%m") AS labels', 'SUM(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `labels`

            }
        }

        $monthqueryTotalSale2 = (new Query()) //daily total sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y-%m") AS labels',
                'SUM(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, SUM(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`

        $monthqueryTotalSale = array_values($monthqueryTotalSale); //insert total sales into transaction per div array

        //--------------------
        $monthqueryDivAverageSale = (new Query()) //daily average sales record seperated by division
            ->select(['DATE_FORMAT(transaction_date, "%Y-%m") AS labels', 'AVG(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, AVG(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `labels`

            }
        }

        $monthqueryTotalAverageSale = (new Query()) //daily total average sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y-%m") AS labels',
                'AVG(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();

        $monthqueryAddress = (new Query()) //total customer per province
            ->select(['address AS labels', 'COUNT(*) as datasets'])
            ->from('customer')
            ->groupBy(['labels'])
            ->orderBy(['datasets' => SORT_DESC])
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, AVG(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`
SELECT `address` AS `labels`, COUNT(*) AS `datasets` FROM `customer` GROUP BY `labels` ORDER BY `datasets` DESC

            $monthcurrentDate->modify('+1 month');
        }

        $monthexistingDates = Site::find() //looks for existing date(YYY-MM) record
            ->select(['DATE_FORMAT(month, "%Y-%m") AS month'])
            ->from('month_label')
            ->groupBy('month')
            ->orderBy(['month' => SORT_ASC])
            ->asArray()
            ->column();
---
SELECT DATE_FORMAT(month, "%Y-%m") AS `month` FROM `month_label` GROUP BY `month` ORDER BY `month`


        //------FOR DATE FORMATTING MONTH-------END

        $monthLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
            ->select(['DATE_FORMAT(month, "%Y-%m") AS month'])
            ->from('month_label')
            ->groupBy('month')
            ->orderBy(['month' => SORT_ASC])
            ->all();

        //---------------------------------for year
        $yearqueryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
            ->select([
                'DATE_FORMAT(transaction_date, "%Y") AS labels',
                'COUNT(*) AS datasets', 'division AS label'
            ])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('transaction_date')
            ->all();
---
SELECT DATE_FORMAT(month, "%Y-%m") AS `month` FROM `month_label` GROUP BY `month` ORDER BY `month`
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `transaction_date`

            }
        }

        $yearqueryAllDate2 = (new Query()) //daily transaction record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y") AS labels',
                'COUNT(*) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, COUNT(*) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`

        $yearqueryAllDate = array_values($yearqueryAllDate); //insert total transaction into transaction per div array

        //--------------
        $yearqueryTotalSale = (new Query()) //daily sales record seperated by division
            ->select(['DATE_FORMAT(transaction_date, "%Y") AS labels', 'SUM(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `labels`

            }
        }

        $yearqueryTotalSale2 = (new Query()) //daily total sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y") AS labels',
                'SUM(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, SUM(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`

        $yearqueryTotalSale = array_values($yearqueryTotalSale); //insert total sales into transaction per div array

        //--------------------
        $yearqueryDivAverageSale = (new Query()) //daily average sales record seperated by division
            ->select(['DATE_FORMAT(transaction_date, "%Y") AS labels', 'AVG(amount) AS datasets', 'division AS label'])
            ->from('visualight2data.transaction') //from visualight2data database within transaction table
            ->groupBy('labels, label')
            ->orderBy('labels')
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, AVG(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` GROUP BY `labels`, `label` ORDER BY `labels`

            }
        }

        $yearqueryTotalAverageSale = (new Query()) //daily total average sales record, separated kasi eto yung total transaction of 2 divisions
            ->select([
                'DATE_FORMAT(transaction_date, "%Y") AS labels',
                'AVG(amount) AS datasets',
                new \yii\db\Expression("CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label")
            ])
            ->from('visualight2data.transaction')
            ->groupBy('labels')
            ->orderBy('labels')
            ->all();

        $yearqueryAddress = (new Query()) //total customer per province
            ->select(['address AS labels', 'COUNT(*) as datasets'])
            ->from('customer')
            ->groupBy(['labels'])
            ->orderBy(['datasets' => SORT_DESC])
            ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, AVG(amount) AS `datasets`, CASE WHEN division IS NOT NULL THEN 'Total' ELSE NULL END AS label FROM `visualight2data`.`transaction` GROUP BY `labels` ORDER BY `labels`
SELECT `address` AS `labels`, COUNT(*) AS `datasets` FROM `customer` GROUP BY `labels` ORDER BY `datasets` DESC

            ->groupBy('c.address')
            ->orderBy(['bs.transaction_date']);

        $yearLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
            ->select(['DATE_FORMAT(month, "%Y") AS year'])
            ->from('month_label')
            ->groupBy('year')
            ->orderBy(['year' => SORT_ASC])
            ->all();
---
SELECT DATE_FORMAT(month, "%Y") AS `year` FROM `month_label` GROUP BY `year` ORDER BY `year`