backend/views/layouts/sidebar.php

$userName = ucfirst($userName); // Convert the first letter to uppercase.

$userId = Yii::$app->user->id;
$model = \common\models\UserProfile::findOne(['id' => $userId]);
---
SELECT * FROM `user` WHERE `id`=1