common/models/User.php

SELECT * FROM `user` WHERE (`username`='super_admin') OR (`email`='super_admin')
---
       public static function findByUsernameOrEmail($usernameOrEmail)
    {
        return static::find()
            ->where(['or', ['username' => $usernameOrEmail], ['email' => $usernameOrEmail]])
            ->one();

SELECT * FROM `user` WHERE (`id`=1) AND (`status` IN (10, 5))
---
    public static function findIdentity($id)
{
    return static::findOne([
        'id' => $id,
        'status' => [self::STATUS_ACTIVE, self::STATUS_EMAIL_NOT_VERIFIED],
    ]);