backend/views/site/index.php

SELECT `ct`.`type` AS `customer_type`, `tt`.`type` AS `transaction_type`, COUNT(*) AS `transaction_count`, SUM(t.amount) AS `total_amount`, `ts`.`status` AS `transaction_status`, `t`.`transaction_date`, `pm`.`method` AS `payment_method`, `c`.`address`, `d`.`division` FROM `transaction` `t` INNER JOIN `customer` `c` ON t.customer_id = c.id INNER JOIN `customer_type` `ct` ON c.customer_type = ct.id INNER JOIN `transaction_type` `tt` ON t.transaction_type = tt.id INNER JOIN `transaction_status` `ts` ON t.transaction_status = ts.id INNER JOIN `payment_method` `pm` ON t.payment_method = pm.id INNER JOIN `division` `d` ON t.division= d.id GROUP BY `ct`.`type`, `tt`.`type`, `ts`.`status`, `t`.`transaction_date`, `pm`.`method`, `c`.`address`, `d`.`division` ORDER BY `transaction_count` DESC
---


$customerTypeDatapertransaction = (new \yii\db\Query())
    ->select([
        'ct.type as customer_type',
        'tt.type as transaction_type',
        'COUNT(*) as transaction_count',
        'SUM(t.amount) as total_amount',
        'ts.status as transaction_status',
        't.transaction_date',
        'pm.method as payment_method',
        'c.address',
        'd.division'
    ])
    ->from('transaction t')
    ->join('INNER JOIN', 'customer c', 't.customer_id = c.id')
    ->join('INNER JOIN', 'customer_type ct', 'c.customer_type = ct.id')
    ->join('INNER JOIN', 'transaction_type tt', 't.transaction_type = tt.id')
    ->join('INNER JOIN', 'transaction_status ts', 't.transaction_status = ts.id')
    ->join('INNER JOIN', 'payment_method pm', 't.payment_method = pm.id')
    ->join('INNER JOIN', 'division d', 't.division= d.id')
    ->groupBy(['ct.type', 'tt.type', 'ts.status', 't.transaction_date', 'pm.method', 'c.address', 'd.division'])
    ->orderBy(['transaction_count' => SORT_DESC])
    ->all();

SELECT DISTINCT YEAR(t.transaction_date) AS `year` FROM `transaction` `t` ORDER BY `year`
---
}


$TransactionYear = (new \yii\db\Query())
    ->select(['YEAR(t.transaction_date) as year'])
    ->distinct()
    ->from('transaction t')
    ->orderBy(['year' => SORT_ASC])
    ->all();

SELECT `payment_method`, COUNT(*) AS `customer_count` FROM `transaction` WHERE `transaction_status`='1' GROUP BY `payment_method` ORDER BY `customer_count` DESC
---



$PaymentMethodData = $query->select(['payment_method', 'COUNT(*) as customer_count'])
    ->from('transaction')
    ->where(['transaction_status' => ['1']])
    ->groupBy(['payment_method'])
    ->orderBy(['customer_count' => SORT_DESC])
    ->all();

SELECT COUNT(*) FROM `transaction` WHERE (`division`='1') AND (`transaction_date`='2023-12-09')
SELECT COUNT(*) FROM `transaction` WHERE (`division`='1') AND (`transaction_date`='2023-12-08')
---
date_default_timezone_set('Asia/Manila');
//Metrology transaction
//dito banda kukunin yung number of transaction tapos kung anong date
$todaymettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '1',
        'transaction_date' => date('Y-m-d') // Assuming you want the number of transactions for today
    ])
    ->scalar();

$lastmettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '1',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();

SELECT COUNT(*) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-09')
SELECT COUNT(*) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-08')
---


//S&T transaction
$todaySandTtrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d')
    ])
    ->scalar();

$lastSandTtrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();