backend/modules/nmd/controllers/ChartController.php

    public function actionDays()
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = "";
        $toDate = "";
        if (Yii::$app->request->isAjax) {

            $fromDate = Yii::$app->request->post('fromDate');
            $toDate = Yii::$app->request->post('toDate');

            //----------------------START OF REGIONAL PROVINCE DAYS-----------------------------------

            $custmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Metro Manila']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART DAYS

            $queryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
                ->select(['transaction_date AS labels', 'COUNT(*) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address`='Metro Manila') AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `transaction_date` AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $queryTotalSale = (new Query()) //daily sales record seperated by division
                ->select(['transaction_date AS labels', 'SUM(amount) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT `transaction_date` AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $forTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
---
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`

                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])

                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['division' => ['1']])
                ->andWhere(['between', 't1.transaction_date', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forMyChart = (new Query()) //average income per division
                ->select(['division as label', 'ROUND(AVG(amount)) as data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $forMyChartAvgTransaction = (new Query())
                ->select(['COUNT(*) AS data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'transaction_date', $fromDate, $toDate])
                ->all();

            $chartLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
                ->select('date AS labels')
                ->from('date_label')
                ->where(['between', 'date', $fromDate, $toDate])
                ->groupBy('date')
                ->orderBy('date')
                ->all();
---
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE (`division`='1') AND (`t1`.`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount)) AS `data` FROM `transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10') GROUP BY `division`
SELECT COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (`transaction_date` BETWEEN '2023-12-04' AND '2023-12-10')
SELECT `date` AS `labels` FROM `date_label` WHERE `date` BETWEEN '2023-12-04' AND '2023-12-10' GROUP BY `date` ORDER BY `date`

    public function actionMonths()
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = "";
        $toDate = "";
        if (Yii::$app->request->isAjax) {

            $fromDate = Yii::$app->request->post('fromDate');
            $toDate = Yii::$app->request->post('toDate');

            //----------------------START OF REGIONAL PROVINCE DAYS-----------------------------------

            $custmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Metro Manila']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART MONTHS

            $queryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
                ->select(['DATE_FORMAT(transaction_date, "%Y-%m") AS labels', 'COUNT(*) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address`='Metro Manila') AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $queryTotalSale = (new Query()) //daily sales record seperated by division
                ->select(['DATE_FORMAT(transaction_date, "%Y-%m") as labels', 'SUM(amount) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y-%m") AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $forTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
---
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`

                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])

                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forMyChart = (new Query()) //average income per division
                ->select(['division as label', 'ROUND(AVG(amount)) as data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $forMyChartAvgTransaction = (new Query())
                ->select(['COUNT(*) AS data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y-%m")', $fromDate, $toDate])
                ->all();

            $monthLabel = (new Query()) //YYYY-MM will serve as label for the chart, the X axis if you may, move this to actionMonths
                ->select(['DATE_FORMAT(month, "%Y-%m") AS labels'])
                ->from('month_label')
                ->where(['between', 'DATE_FORMAT(month, "%Y-%m")', $fromDate, $toDate])
                ->groupBy('labels')
                ->orderBy('labels')
                ->all();
---
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE (`division`='1') AND (DATE_FORMAT(t1.transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount)) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12') GROUP BY `division`
SELECT COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y-%m") BETWEEN '2023-01' AND '2023-12')
SELECT DATE_FORMAT(month, "%Y-%m") AS `labels` FROM `month_label` WHERE DATE_FORMAT(month, "%Y-%m") BETWEEN '2023-01' AND '2023-12' GROUP BY `labels` ORDER BY `labels`

    public function actionYears()
    {

        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $fromDate = "";
        $toDate = "";
        if (Yii::$app->request->isAjax) {

            $fromDate = Yii::$app->request->post('fromDate');
            $toDate = Yii::$app->request->post('toDate');

            //----------------------START OF REGIONAL PROVINCE DAYS-----------------------------------

            $custmerPerProvinceNCR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Metro Manila']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceRIVA = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal',]])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceMIMAROPA = (new Query()) //use MIMAROPA as desc please
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceV = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceCAR = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bohol', 'Cebu', 'Negros Oriental', 'Siquijor']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceVIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceIX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceX = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXI = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceXIII = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $custmerPerProvinceBARMM = (new Query())
                ->select(['t2.address as label', 'COUNT(t1.customer_id) as data'])
                ->from(['t2' => 'customer'])
                ->join('JOIN', 'transaction t1', 't2.id = t1.customer_id')
                ->where(['division' => ['1']])
                ->andWhere(['t2.address' => ['Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
            //---------END OF PROVINCE----START OF OTHER CHART YEARS

            $queryAllDate = (new Query()) //daily transaction record seperated by division, Y axis for the chart
                ->select(['DATE_FORMAT(transaction_date, "%Y") AS labels', 'COUNT(*) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address`='Metro Manila') AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Ilocos Norte', 'Ilocos Sur', 'La Union', 'Pangasinan')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batanes', 'Cagayan', 'La Union', 'Isabela', 'Quirino', 'Nueva Vizcaya')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aurora', 'Bataan', 'Bulacan', 'Nueba Ecija', 'Pampanga', 'Tarlac', 'Zambales')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Batangas', 'Cavite', 'Laguna', 'Quezon', 'Rizal')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Marinduque', 'Occidental Mindoro', 'Oriental Mindoro', 'Palawan', 'Romblon')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Albay', 'Camarines Sur', 'Camarines Norte', 'Catanduanes', 'Masbate', 'Sorsogon')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Abra', 'Apayao', 'Benguet', 'Ifugao', 'Kalinga', 'Mountain Province')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Aklan', 'Antique', 'Capiz', 'Guimaras', 'Iloilo', 'Negros Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bohol', 'Cebu', 'Negros Oriental', 'Siquijor')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Biliran', 'Eastern Samar', 'Leyte', 'Western Samar', 'Samar', 'Southern Leyte')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Zamboanga del Sur', 'Zamboanga del Norte', 'Zamboanga Sibugay')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Bukidnon', 'Camiguin', 'Lanao del Norte', 'Misamis Oriental', 'Misamis Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Davao de Oro', 'Davao del Norte', 'Davao del Sur', 'Davao Oriental', 'Davao Occidental')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Cotabato', 'Sarangani', 'South Cotabato', 'Sultan Kudarat')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Agusan del Norte', 'Agusan del Sur', 'Dinagat Islands', 'Surigao del Norte', 'Surigao del Sur')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `t2`.`address` AS `label`, COUNT(t1.customer_id) AS `data` FROM `customer` `t2` JOIN `transaction` `t1` ON t2.id = t1.customer_id WHERE (`division`='1') AND (`t2`.`address` IN ('Basilan', 'Lanao del Sur', 'Maguindanao del Norte', 'Sulu', 'Maguindanao del Sur', 'Tawi-Tawi')) AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, COUNT(*) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $queryTotalSale = (new Query()) //daily sales record seperated by division
                ->select(['DATE_FORMAT(transaction_date, "%Y") AS labels', 'SUM(amount) AS datasets', 'division AS label'])
                ->from('visualight2data.transaction') //from visualight2data database within transaction table
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('labels, division')
                ->orderBy('labels')
                ->all();
---
SELECT DATE_FORMAT(transaction_date, "%Y") AS `labels`, SUM(amount) AS `datasets`, `division` AS `label` FROM `visualight2data`.`transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `labels`, `division` ORDER BY `labels`

                }
            }

            $forTransactionStatusChart = (new Query())
                ->select(['transaction_status as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forPaymendtMethodChart = (new Query())
                ->select(['payment_method as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forTransactionTypeChart = (new Query())
                ->select(['transaction_type as label', 'COUNT(*) as data'])
                ->from(['transaction'])
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();
---
SELECT `transaction_status` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `payment_method` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `transaction_type` AS `label`, COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`

                ->select(['t2.customer_type as label', 'COUNT(*) AS data'])
                ->from(['t1' => 'transaction'])

                ->join('JOIN', 'customer t2', 't1.customer_id = t2.id')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(t1.transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('label')
                ->all();

            $forMyChart = (new Query()) //average income per division
                ->select(['division as label', 'ROUND(AVG(amount)) as data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->groupBy('division')
                ->all();

            $forMyChartAvgTransaction = (new Query())
                ->select(['COUNT(*) AS data'])
                ->from('transaction')
                ->where(['division' => ['1']])
                ->andWhere(['between', 'DATE_FORMAT(transaction_date, "%Y")', $fromDate, $toDate])
                ->all();

            $yearLabel = (new Query()) //YYYY-MM will serve as label for the chart, the X axis if you may, move this to actionMonths
                ->select(['DATE_FORMAT(month, "%Y") AS labels'])
                ->from('month_label')
                ->where(['between', 'DATE_FORMAT(month, "%Y")', $fromDate, $toDate])
                ->groupBy('labels')
                ->orderBy('labels')
                ->all();
---
SELECT `t2`.`customer_type` AS `label`, COUNT(*) AS `data` FROM `transaction` `t1` JOIN `customer` `t2` ON t1.customer_id = t2.id WHERE (`division`='1') AND (DATE_FORMAT(t1.transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `label`
SELECT `division` AS `label`, ROUND(AVG(amount)) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023') GROUP BY `division`
SELECT COUNT(*) AS `data` FROM `transaction` WHERE (`division`='1') AND (DATE_FORMAT(transaction_date, "%Y") BETWEEN '2023' AND '2023')
SELECT DATE_FORMAT(month, "%Y") AS `labels` FROM `month_label` WHERE DATE_FORMAT(month, "%Y") BETWEEN '2023' AND '2023' GROUP BY `labels` ORDER BY `labels`

    public function actionIndex()
    {
        Yii::$app->set('db', [ //reroute default connection
            'class' => \yii\db\Connection::class,
            'dsn' => 'mysql:host=localhost;dbname=visualight2data',
            'username' => 'root',
            'password' => '',
            'charset' => 'utf8',
        ]);

        $monthLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
            ->select(['DATE_FORMAT(month, "%Y-%m") AS month'])
            ->from('month_label')
            ->groupBy('month')
            ->orderBy('month')
            ->all();

        $yearLabel = (new Query()) //YYYY-MM-DD will serve as label for the chart, the X axis if you may
            ->select(['DATE_FORMAT(month, "%Y") AS year'])
            ->from('month_label')
            ->groupBy('year')
            ->orderBy('year')
            ->all();
---
SELECT DATE_FORMAT(month, "%Y-%m") AS `month` FROM `month_label` GROUP BY `month` ORDER BY `month`
SELECT DATE_FORMAT(month, "%Y") AS `year` FROM `month_label` GROUP BY `year` ORDER BY `year`