backend/modules/std/views/chart/index.php



$query = new Query();
$addressData = $query->select(['c.address as address', 'COUNT(*) as customer_count']) //joined table of transaction and customer,
    ->from('transaction bs')                                              //since both have id in their columns, aliases are used (bs and c)
    ->innerJoin('customer c', 'bs.customer_id = c.id')
    ->where(['bs.division' => ['1']])
    ->groupBy('c.address')
    ->orderBy('bs.transaction_date')
    ->all();
---
SELECT `c`.`address` AS `address`, COUNT(*) AS `customer_count` FROM `transaction` `bs` INNER JOIN `customer` `c` ON bs.customer_id = c.id WHERE `bs`.`division`='1' GROUP BY `c`.`address` ORDER BY `bs`.`transaction_date`



$query = new Query();
$customerTypeData = $query->select([
    'c.customer_type',
    'customer_count' => new \yii\db\Expression('COUNT(*)')
])
    ->from('transaction bs')
    ->innerJoin(['customer c'], 'bs.customer_id = c.id')
    ->where([
        'bs.division' => 2
    ])
    ->groupBy('c.customer_type')
    ->orderBy('bs.transaction_date')
    ->all();
---
SELECT `c`.`customer_type`, COUNT(*) AS `customer_count` FROM `transaction` `bs` INNER JOIN `customer` `c` ON bs.customer_id = c.id WHERE `bs`.`division`=2 GROUP BY `c`.`customer_type` ORDER BY `bs`.`transaction_date`

}

//transaction used per customer type
$customerTypeDatapertransaction = (new \yii\db\Query())
    ->select([
        'ct.type as customer_type',
        'tt.type as transaction_type',
        'COUNT(*) as transaction_count',
        'SUM(t.amount) as total_amount',
        'ts.status as transaction_status',
        't.transaction_date',
        'pm.method as payment_method',
    ])
    ->from('transaction t')
    ->where(['t.division' => '2',])
    ->join('INNER JOIN', 'customer c', 't.customer_id = c.id')
    ->join('INNER JOIN', 'customer_type ct', 'c.customer_type = ct.id')
    ->join('INNER JOIN', 'transaction_type tt', 't.transaction_type = tt.id')
    ->join('INNER JOIN', 'transaction_status ts', 't.transaction_status = ts.id')
    ->join('INNER JOIN', 'payment_method pm', 't.payment_method = pm.id')
    ->groupBy(['ct.type', 'tt.type', 'ts.status', 't.transaction_date', 'pm.method'])
    ->orderBy(['transaction_count' => SORT_DESC])
    ->all();
---
SELECT `ct`.`type` AS `customer_type`, `tt`.`type` AS `transaction_type`, COUNT(*) AS `transaction_count`, SUM(t.amount) AS `total_amount`, `ts`.`status` AS `transaction_status`, `t`.`transaction_date`, `pm`.`method` AS `payment_method` FROM `transaction` `t` INNER JOIN `customer` `c` ON t.customer_id = c.id INNER JOIN `customer_type` `ct` ON c.customer_type = ct.id INNER JOIN `transaction_type` `tt` ON t.transaction_type = tt.id INNER JOIN `transaction_status` `ts` ON t.transaction_status = ts.id INNER JOIN `payment_method` `pm` ON t.payment_method = pm.id WHERE `t`.`division`='2' GROUP BY `ct`.`type`, `tt`.`type`, `ts`.`status`, `t`.`transaction_date`, `pm`.`method` ORDER BY `transaction_count` DESC

    $ctpm[] = $type['payment_method']; // Store the payment_method value
}

$TransactionYear = (new \yii\db\Query())
    ->select(['YEAR(t.transaction_date) as year'])
    ->distinct()
    ->from('transaction t')
    ->orderBy(['year' => SORT_ASC])
    ->all();
---
SELECT DISTINCT YEAR(t.transaction_date) AS `year` FROM `transaction` `t` ORDER BY `year`

date_default_timezone_set('Asia/Manila');

//Total Transaction everyday changes depending on date
$todaymettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d') // Assuming you want the number of transactions for today
    ])
    ->scalar();

$lastmettrans = (new Query())
    ->select('COUNT(*)')
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();
---
SELECT COUNT(*) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-09')
SELECT COUNT(*) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-08')



//Here should be the sum of total sales everyday
$SalesToday = (new Query())
    ->select(['SUM(amount)'])
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d') // Using the current date in 'Y-m-d' format
    ])
    ->scalar();

$SalesYesterday = (new Query())
    ->select(['SUM(amount)'])
    ->from('transaction')
    ->where([
        'division' => '2',
        'transaction_date' => date('Y-m-d', strtotime('-1 day'))
    ])
    ->scalar();
---
SELECT SUM(amount) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-09')
SELECT SUM(amount) FROM `transaction` WHERE (`division`='2') AND (`transaction_date`='2023-12-08')